In [3]:
import requests
import pandas as pd
#Define the basis of the request
url="https://api.bcb.gov.br/dados/serie/bcdata.sgs.1/dados?formato=json"

In [5]:
response=requests.get(url=url)
response

In [6]:
table=pd.DataFrame(response.json())
table

             data      valor
0      28/11/1984  2828.0000
1      29/11/1984  2828.0000
2      30/11/1984  2881.0000
3      03/12/1984  2881.0000
4      04/12/1984  2881.0000
...           ...        ...
10021  26/11/2024     5.7990
10022  27/11/2024     5.8291
10023  28/11/2024     5.9871
10024  29/11/2024     6.0535
10025  02/12/2024     6.0634

[10026 rows x 2 columns]

In [7]:
table.to_json(path_or_buf='file_json_bc.json')

In [9]:
from sqlalchemy import create_engine, inspect
bank_data=create_engine('sqlite:///file/file_json.sqlite')
conection=bank_data.connect()
conection

In [ ]:
table.to_sql('api_bc', con=conection, index=False)

10026

In [ ]:
#See table names
conection=bank_data.connect()
inspecte=inspect(bank_data)
inspecte.get_table_names()

['api_bc']

In [18]:
#See columns names
inspecte.get_columns(table_name='api_bc')

[{'name': 'data',
  'type': TEXT(),
  'nullable': True,
  'default': None,
  'primary_key': 0},
 {'name': 'valor',
  'type': TEXT(),
  'nullable': True,
  'default': None,
  'primary_key': 0}]

In [ ]:
#Import database
data=pd.read_sql('api_bc',con=conection)
data.to_csv(path_or_buf=)

             data      valor
0      28/11/1984  2828.0000
1      29/11/1984  2828.0000
2      30/11/1984  2881.0000
3      03/12/1984  2881.0000
4      04/12/1984  2881.0000
...           ...        ...
10021  26/11/2024     5.7990
10022  27/11/2024     5.8291
10023  28/11/2024     5.9871
10024  29/11/2024     6.0535
10025  02/12/2024     6.0634

[10026 rows x 2 columns]